lnxgod/friendorfoe/esp32/scanner/main/main.c
/**
 * Friend or Foe -- WiFi + BLE Scanner Firmware Entry Point
 *
 * Dual-mode scanner: WiFi promiscuous + BLE Remote ID + privacy device
 * detection. BOOT button double-tap switches OLED between drone view
 * and privacy/glasses view.
 *
 * Architecture:
 *   Core 0 (radio):      WiFi scan task + BLE scan (NimBLE)
 *   Core 1 (processing): UART TX task (fusion runs inline)
 *
 * Detection flow:
 *   WiFi scanner ──▶ detection_queue ──▶ UART TX task
 *                         (50 items)       │
 *                                          ├── Bayesian fusion
 *                                          └── JSON → UART1 → Uplink
 *   BLE scanner  ──▶ detection_queue (drones)
 *                ──▶ glasses_queue   (privacy devices → OLED)
 */

#include "wifi_scanner.h"
#include "bayesian_fusion.h"
#include "uart_tx.h"
#include "detection_types.h"
#include "uart_protocol.h"
#include "task_priorities.h"
#include "calibration_mode.h"
#include "led_status.h"
#include "oled_display.h"
#include "ble_remote_id.h"
#include "time_sync_policy.h"

#if CONFIG_FOF_GLASSES_DETECTION
#include "glasses_detector.h"
#endif

#include "esp_log.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_timer.h"
#include "esp_app_desc.h"
#include "esp_heap_caps.h"
#include "psram_alloc.h"
#include "nvs_flash.h"
#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/queue.h"

#include <string.h>

/* ── Constants ──────────────────────────────────────────────────────────── */

static const char *TAG = "fof_scanner";

#include "version.h"

#ifdef WIFI_SCANNER_ONLY
#define FIRMWARE_NAME "wifi-scanner"
#else
#define FIRMWARE_NAME "scanner"
#endif
#define DETECTION_QUEUE_LEN 50
#define DISPLAY_UPDATE_MS   250

/* ── BOOT button ────────────────────────────────────────────────────────── */

#define BOOT_BUTTON_GPIO    GPIO_NUM_9   /* ESP32-C5 BOOT = GPIO9 */
#define LONG_PRESS_MS       1500
#define DOUBLE_TAP_WINDOW_MS 600

/* Button state */
static bool     s_btn_was_pressed = false;
static int64_t  s_btn_press_start = 0;
static int      s_tap_count       = 0;
static int64_t  s_last_tap_time   = 0;

/* Detected events */
static volatile bool s_button_short  = false;
static volatile bool s_button_double = false;

/* ── Wall-clock time offset (v0.60+) ─────────────────────────────────────
 * Scanners don't have a network stack and can't NTP themselves. The uplink
 * pushes its epoch-ms clock over UART every 10 s as {"type":"time","ms":N};
 * the listener below stores the offset vs local esp_timer_get_time(). The
 * serializer in uart_tx adds this offset to every detection's ts field so
 * all nodes emit a common epoch timeline for triangulation clustering.
 * Stays at 0 until the first sync arrives (detections then carry uptime-ms,
 * which the backend ignores via the "> 1700000000" validity check). */
volatile int64_t g_epoch_offset_ms = 0;

/* Counter — increments on every {"type":"time"} message received, regardless
 * of whether the epoch_ms was usable. Reported via scanner_info → uplink
 * → /detections/nodes/status to diagnose UART path vs HTTP-fetch failure
 * without serial console access. */
volatile uint32_t g_time_msg_count = 0;
volatile uint32_t g_time_valid_count = 0;
volatile int64_t g_last_valid_time_local_ms = 0;

static void maybe_expire_time_sync(int64_t now_ms)
{
    if (g_epoch_offset_ms != 0 &&
        fof_time_offset_is_stale(g_last_valid_time_local_ms,
                                 now_ms,
                                 FOF_TIME_SYNC_STALE_AFTER_MS)) {
        ESP_LOGW(TAG, "TIME SYNC stale after %lld ms — clearing epoch offset",
                 (long long)(now_ms - g_last_valid_time_local_ms));
        g_epoch_offset_ms = 0;
    }
}

/* ── Glasses detection cache ────────────────────────────────────────────── */

#if CONFIG_FOF_GLASSES_DETECTION
#define GLASSES_CACHE_SIZE  10
#define GLASSES_STALE_MS    60000

static QueueHandle_t s_glasses_queue = NULL;

typedef struct {
    glasses_detection_t det;
    bool                occupied;
} glasses_cache_entry_t;

static glasses_cache_entry_t s_glasses_cache[GLASSES_CACHE_SIZE];
static int s_glasses_count = 0;

static void glasses_cache_update(void)
{
    /* Drain queue into cache */
    glasses_detection_t gdet;
    while (xQueueReceive(s_glasses_queue, &gdet, 0) == pdTRUE) {
        /* Find existing entry by MAC or empty slot */
        int slot = -1;
        int oldest_slot = -1;
        int64_t oldest_time = INT64_MAX;

        for (int i = 0; i < GLASSES_CACHE_SIZE; i++) {
            if (s_glasses_cache[i].occupied &&
                memcmp(s_glasses_cache[i].det.mac, gdet.mac, 6) == 0) {
                slot = i;
                break;
            }
            if (!s_glasses_cache[i].occupied && slot < 0) {
                slot = i;
            }
            if (s_glasses_cache[i].occupied &&
                s_glasses_cache[i].det.last_seen_ms < oldest_time) {
                oldest_time = s_glasses_cache[i].det.last_seen_ms;
                oldest_slot = i;
            }
        }

        if (slot < 0) slot = oldest_slot;  /* evict oldest */
        if (slot >= 0) {
            s_glasses_cache[slot].det = gdet;
            s_glasses_cache[slot].occupied = true;
        }
    }

    /* Prune stale entries */
    int64_t now_ms = esp_timer_get_time() / 1000;
    s_glasses_count = 0;
    for (int i = 0; i < GLASSES_CACHE_SIZE; i++) {
        if (s_glasses_cache[i].occupied) {
            if ((now_ms - s_glasses_cache[i].det.last_seen_ms) > GLASSES_STALE_MS) {
                s_glasses_cache[i].occupied = false;
            } else {
                s_glasses_count++;
            }
        }
    }
}

static glasses_detection_t *glasses_cache_get(int index)
{
    int count = 0;
    for (int i = 0; i < GLASSES_CACHE_SIZE; i++) {
        if (s_glasses_cache[i].occupied) {
            if (count == index) return &s_glasses_cache[i].det;
            count++;
        }
    }
    return NULL;
}
#endif /* CONFIG_FOF_GLASSES_DETECTION */

/* ── View state ─────────────────────────────────────────────────────────── */

