lnxgod/friendorfoe/esp32/scanner/main/main.c
static bool s_show_privacy = false;  /* false = drone view, true = privacy view */

/* ── Button polling ─────────────────────────────────────────────────────── */

static void poll_button(void)
{
    int level = gpio_get_level(BOOT_BUTTON_GPIO);
    int64_t now_ms = esp_timer_get_time() / 1000;

    if (level == 0 && !s_btn_was_pressed) {
        /* Button just pressed (active low) */
        s_btn_was_pressed = true;
        s_btn_press_start = now_ms;
    } else if (level == 1 && s_btn_was_pressed) {
        /* Button just released */
        s_btn_was_pressed = false;
        int64_t duration = now_ms - s_btn_press_start;

        if (duration < LONG_PRESS_MS) {
            /* Short press = tap */
            s_tap_count++;
            s_last_tap_time = now_ms;
        }
    }

    /* Check for completed tap sequences */
    if (s_tap_count > 0 && !s_btn_was_pressed &&
        (now_ms - s_last_tap_time) > DOUBLE_TAP_WINDOW_MS) {
        if (s_tap_count >= 2) {
            s_button_double = true;
        } else {
            s_button_short = true;
        }
        s_tap_count = 0;
    }
}

/* ── Display update task ───────────────────────────────────────────────── */

static void display_task(void *arg)
{
    ESP_LOGI(TAG, "Display task started (BOOT: tap=scroll, 2x=view toggle)");

    int page_index = 0;
    int cycle_counter = 0;

    /* Advance page every 10 ticks = 2.5s at 250ms refresh */
    #define PAGE_CYCLE_TICKS 10

    while (1) {
        /* Poll button every cycle */
        poll_button();

        /* Handle double-tap: toggle view */
        if (s_button_double) {
            s_button_double = false;
            s_show_privacy = !s_show_privacy;
            page_index = 0;
            cycle_counter = 0;
            ESP_LOGI(TAG, "View switched to %s", s_show_privacy ? "PRIVACY" : "DRONES");
        }

        /* Handle single tap: scroll page */
        if (s_button_short) {
            s_button_short = false;
            page_index++;
            cycle_counter = 0;
        }

        uint32_t uptime = (uint32_t)(xTaskGetTickCount() / configTICK_RATE_HZ);

#if CONFIG_FOF_GLASSES_DETECTION
        if (s_show_privacy) {
            /* ── Privacy view ──────────────────────────────────────────── */
            glasses_cache_update();

            if (s_glasses_count > 0) {
                if (page_index >= s_glasses_count) page_index = 0;

                glasses_detection_t *g = glasses_cache_get(page_index);
                if (g) {
                    oled_show_glasses_paged(
                        g->device_type, g->manufacturer,
                        g->device_name, g->confidence,
                        g->rssi, g->has_camera,
                        page_index + 1, s_glasses_count);
                }

                cycle_counter++;
                if (cycle_counter >= PAGE_CYCLE_TICKS) {
                    cycle_counter = 0;
                    page_index = (page_index + 1) % s_glasses_count;
                }
            } else {
                oled_show_privacy_status(0, uptime);
            }
        } else
#endif
        {
            /* ── Drone view (default) ──────────────────────────────────── */
            int total       = uart_tx_get_total_count();
            int active      = bayesian_fusion_get_active_count();
            uint8_t channel = uart_tx_get_current_channel();
            int ble         = uart_tx_get_ble_count();
            int wifi        = uart_tx_get_wifi_count();

            oled_update(total, active, channel, ble, wifi, uptime);

            scanner_detection_summary_t det_list[DETECTION_CACHE_SIZE];
            int det_count = uart_tx_get_cached_detections(det_list, DETECTION_CACHE_SIZE);

            if (det_count > 0) {
                if (page_index >= det_count) page_index = 0;

                oled_show_detection_paged(
                    det_list[page_index].drone_id,
                    det_list[page_index].manufacturer,
                    det_list[page_index].confidence,
                    det_list[page_index].rssi,
                    page_index + 1, det_count);

                cycle_counter++;
                if (cycle_counter >= PAGE_CYCLE_TICKS) {
                    cycle_counter = 0;
                    page_index = (page_index + 1) % det_count;
                }
            }
        }

        vTaskDelay(pdMS_TO_TICKS(DISPLAY_UPDATE_MS));
    }
}

/* ── UART command listener (lock-on from uplink) ──────────────────────── */

#ifndef BLE_SCANNER_ONLY
#include "driver/uart.h"
#include "cJSON.h"
#include "comms/uart_ota.h"
#include "esp_ota_ops.h"

static void send_cal_mode_ack(bool ok_flag)
{
    char ack[192];
    snprintf(
        ack,
        sizeof(ack),
        "{\"type\":\"%s\",\"ok\":%s,\"session_id\":\"%s\",\"scan_mode\":\"%s\",\"calibration_uuid\":\"%s\"}",
        MSG_TYPE_CAL_MODE_ACK,
        ok_flag ? "true" : "false",
        scanner_calibration_mode_session_id(),
        scanner_calibration_mode_label(),
        scanner_calibration_mode_uuid()
    );
    uart_tx_send_raw_json(ack);
}

static void uart_cmd_listener_task(void *arg)
{
    uint8_t buf[256];
    char line[256];
    int line_pos = 0;

    ESP_LOGI(TAG, "UART cmd listener on UART1 (commands + OTA from uplink)");

    /* Determine board identity at compile time — matches firmware catalog names */
#if defined(BLE_SCANNER_ONLY)
    static const char *s_board_name = "scanner-s3-ble";
    static const char *s_chip_name = "esp32s3";
    static const char *s_caps = "ble";
#elif defined(WIFI_SCANNER_ONLY) && defined(CONFIG_IDF_TARGET_ESP32C5)
    static const char *s_board_name = "scanner-c5";
    static const char *s_chip_name = "esp32c5";
    static const char *s_caps = "wifi,5ghz";
#elif defined(WIFI_SCANNER_ONLY)
    static const char *s_board_name = "scanner-esp32";
    static const char *s_chip_name = "esp32";
    static const char *s_caps = "wifi";
#elif defined(SEED_SCANNER_PINS)
    static const char *s_board_name = "scanner-s3-combo-seed";
    static const char *s_chip_name = "esp32s3";
    static const char *s_caps = "ble,wifi";
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
    static const char *s_board_name = "scanner-s3-combo";
    static const char *s_chip_name = "esp32s3";
    static const char *s_caps = "ble,wifi";
#else
    static const char *s_board_name = "scanner-esp32";
    static const char *s_chip_name = "esp32";
    static const char *s_caps = "wifi";
#endif

    /* Send scanner identity immediately on boot — uplink needs this to know
     * what's connected, even before sending "ready". This is a small JSON
     * message, not a data flood. */
    {
        /* Use FOF_VERSION (shared/version.h) rather than the ESP-IDF app
         * version — FOF_VERSION is the single source of truth we bump in
         * lockstep across uplink + scanner. */
        uart_tx_send_scanner_info(FOF_VERSION, s_board_name, s_chip_name, s_caps);
        ESP_LOGI(TAG, "Sent identity: %s v%s (%s) — waiting for uplink start command",
                 s_board_name, FOF_VERSION, s_caps);
    }

