lnxgod/friendorfoe/esp32/scanner/main/main.c
    TickType_t last_info_send = xTaskGetTickCount();

    while (1) {
        maybe_expire_time_sync(esp_timer_get_time() / 1000);
        int len = uart_read_bytes(UART_NUM_1, buf, sizeof(buf), pdMS_TO_TICKS(500));

        /* Resend scanner_info every 10s — always, even when TX is stopped.
         * This lets the uplink see us and know our version/capabilities.
         * Also sends TX state so uplink knows if we're waiting or active. */
        /* Suppress all UART TX during OTA — scanner must be silent so the
         * UART is fully dedicated to receiving firmware chunks. */
        if (!uart_ota_is_active() &&
            (xTaskGetTickCount() - last_info_send) >= pdMS_TO_TICKS(10000)) {
            last_info_send = xTaskGetTickCount();
            uart_tx_send_scanner_info(FOF_VERSION, s_board_name, s_chip_name, s_caps);
            /* Send status even when stopped — uplink can see we're alive */
            if (!uart_tx_is_enabled()) {
                ESP_LOGD(TAG, "Scanner waiting for start command (TX disabled)");
            }
        }

        if (len <= 0) continue;

        /* During OTA: route raw bytes to OTA receiver */
        if (uart_ota_is_active()) {
            uart_ota_process_data(buf, len);
            continue;
        }

        ESP_LOGD(TAG, "UART CMD RX: %d bytes [%02X %02X %02X %02X...]",
                 len, buf[0], len > 1 ? buf[1] : 0, len > 2 ? buf[2] : 0, len > 3 ? buf[3] : 0);

        for (int i = 0; i < len; i++) {
            if (buf[i] == '\n') {
                if (line_pos > 0) {
                    line[line_pos] = '\0';
                    /* Parse JSON command */
                    ESP_LOGD(TAG, "UART CMD LINE (%d chars): '%.*s'",
                             line_pos, line_pos > 48 ? 48 : line_pos, line);
                    cJSON *root = cJSON_Parse(line);
                    if (root) {
                        const char *type = NULL;
                        cJSON *t = cJSON_GetObjectItem(root, "type");
                        if (t && t->valuestring) type = t->valuestring;
                        ESP_LOGD(TAG, "UART CMD TYPE: '%s'", type ? type : "(null)");

                        if (type && (strcmp(type, "ready") == 0 || strcmp(type, "start") == 0)) {
                            /* Uplink tells scanner to start transmitting */
                            extern void uart_tx_set_enabled(bool enabled);
                            uart_tx_set_enabled(true);
                            ESP_LOGI(TAG, "Uplink sent START — TX enabled");

                        } else if (type && strcmp(type, "stop") == 0) {
                            /* Uplink tells scanner to stop transmitting.
                             * Emit stop_ack so the uplink's relay handler
                             * knows our TX loop is halted before it starts
                             * the OTA begin handshake (v0.59+). */
                            extern void uart_tx_set_enabled(bool enabled);
                            extern void uart_tx_send_raw_json(const char *json_str);
                            uart_tx_set_enabled(false);
                            uart_tx_send_raw_json("{\"type\":\"stop_ack\"}");
                            ESP_LOGI(TAG, "Uplink sent STOP — TX disabled, ack sent");

                        } else if (type && strcmp(type, "lockon") == 0) {
                            if (scanner_calibration_mode_is_active()) {
                                ESP_LOGW(TAG, "Rejecting WiFi lock-on while calibration mode is active");
                                cJSON_Delete(root);
                                line_pos = 0;
                                continue;
                            }
                            cJSON *ch = cJSON_GetObjectItem(root, "ch");
                            cJSON *dur = cJSON_GetObjectItem(root, "dur");
                            cJSON *bssid = cJSON_GetObjectItem(root, "bssid");
                            int channel = ch ? ch->valueint : 6;
                            int duration = dur ? dur->valueint : 60;
                            const char *bssid_str = (bssid && bssid->valuestring) ? bssid->valuestring : NULL;

                            ESP_LOGW(TAG, "WiFi LOCK-ON: ch=%d dur=%ds bssid=%s",
                                     channel, duration, bssid_str ? bssid_str : "*");
                            wifi_scanner_lockon((uint8_t)channel, bssid_str, duration);

                        } else if (type && strcmp(type, "lockon_cancel") == 0) {
                            if (scanner_calibration_mode_is_active()) {
                                ESP_LOGW(TAG, "Ignoring WiFi lock-on cancel while calibration mode is active");
                                cJSON_Delete(root);
                                line_pos = 0;
                                continue;
                            }
                            ESP_LOGI(TAG, "WiFi LOCK-ON cancel");
                            wifi_scanner_lockon_cancel();


#ifndef WIFI_SCANNER_ONLY
                        } else if (type && strcmp(type, "ble_lockon") == 0) {
                            if (scanner_calibration_mode_is_active()) {
                                ESP_LOGW(TAG, "Rejecting BLE focus while calibration mode is active");
                                cJSON_Delete(root);
                                line_pos = 0;
                                continue;
                            }
                            cJSON *mac_j = cJSON_GetObjectItem(root, "mac");
                            cJSON *dur = cJSON_GetObjectItem(root, "dur");
                            int duration = dur ? dur->valueint : 45;
                            if (mac_j && mac_j->valuestring && strlen(mac_j->valuestring) >= 17) {
                                uint8_t mac[6];
                                unsigned int m[6];
                                if (sscanf(mac_j->valuestring, "%02x:%02x:%02x:%02x:%02x:%02x",
                                           &m[0], &m[1], &m[2], &m[3], &m[4], &m[5]) == 6) {
                                    for (int j = 0; j < 6; j++) mac[j] = (uint8_t)m[j];
                                    ESP_LOGW(TAG, "BLE FOCUS: %s dur=%ds", mac_j->valuestring, duration);
                                    ble_rid_lockon(mac, duration);
                                }
                            }
                        } else if (type && strcmp(type, "ble_lockon_cancel") == 0) {
                            if (scanner_calibration_mode_is_active()) {
                                ESP_LOGW(TAG, "Ignoring BLE focus cancel while calibration mode is active");
                                cJSON_Delete(root);
                                line_pos = 0;
                                continue;
                            }
                            ESP_LOGI(TAG, "BLE FOCUS cancel");
                            ble_rid_lockon_cancel();
#endif /* !WIFI_SCANNER_ONLY */

