lnxgod/friendorfoe/esp32/scanner/main/main.c
                        } else if (type && strcmp(type, MSG_TYPE_CAL_MODE_START) == 0) {
                            cJSON *session_j = cJSON_GetObjectItem(root, JSON_KEY_SESSION_ID);
                            cJSON *uuid_j = cJSON_GetObjectItem(root, JSON_KEY_CALIBRATION_UUID);
                            bool ok = false;
                            if (session_j && session_j->valuestring &&
                                uuid_j && uuid_j->valuestring) {
                                ok = scanner_calibration_mode_start(
                                    session_j->valuestring,
                                    uuid_j->valuestring
                                );
                            }
                            send_cal_mode_ack(ok);
                            ESP_LOGW(TAG, "Calibration mode %s for session=%s uuid=%s",
                                     ok ? "armed" : "rejected",
                                     session_j && session_j->valuestring ? session_j->valuestring : "?",
                                     uuid_j && uuid_j->valuestring ? uuid_j->valuestring : "?");

                        } else if (type && strcmp(type, MSG_TYPE_CAL_MODE_STOP) == 0) {
                            scanner_calibration_mode_stop("uplink_stop");
                            send_cal_mode_ack(true);

                        } else if (type && strcmp(type, MSG_TYPE_TIME) == 0) {
                            /* Uplink broadcasts its epoch-ms every 10s.
                             * Use a small flag so /api/status can show that we
                             * received SOMETHING even if the value was bad —
                             * helps diagnose UART vs HTTP-fetch failure. */
                            extern volatile int64_t g_epoch_offset_ms;
                            extern volatile uint32_t g_time_msg_count;
                            extern volatile uint32_t g_time_valid_count;
                            extern volatile int64_t g_last_valid_time_local_ms;
                            g_time_msg_count++;
                            cJSON *ms_j = cJSON_GetObjectItem(root, JSON_KEY_EPOCH_MS);
                            cJSON *ok_j = cJSON_GetObjectItem(root, JSON_KEY_TIME_OK);
                            bool has_ok = ok_j && (cJSON_IsBool(ok_j) || cJSON_IsNumber(ok_j));
                            bool ok = cJSON_IsTrue(ok_j) || (cJSON_IsNumber(ok_j) && ok_j->valueint != 0);
                            if (ms_j && cJSON_IsNumber(ms_j)) {
                                int64_t epoch_ms = (int64_t)ms_j->valuedouble;
                                if (fof_time_message_is_valid(has_ok, ok, epoch_ms)) {
                                    int64_t local_ms = esp_timer_get_time() / 1000;
                                    g_epoch_offset_ms = epoch_ms - local_ms;
                                    g_time_valid_count++;
                                    g_last_valid_time_local_ms = local_ms;
                                    ESP_LOGD(TAG, "TIME SYNC: epoch=%lld local=%lld offset=%lld",
                                             (long long)epoch_ms, (long long)local_ms,
                                             (long long)g_epoch_offset_ms);
                                } else {
                                    ESP_LOGW(TAG, "TIME SYNC rejected: epoch_ms=%lld ok=%s",
                                             (long long)epoch_ms,
                                             has_ok ? (ok ? "true" : "false") : "legacy");
                                }
                            }

                        } else if (type && strcmp(type, MSG_TYPE_OTA_BEGIN) == 0) {
                            /* UART OTA: receive firmware from uplink */
                            cJSON *sz = cJSON_GetObjectItem(root, "size");
                            cJSON *crc_j = cJSON_GetObjectItem(root, "crc");
                            uint32_t total = sz ? (uint32_t)sz->valueint : 0;
                            uint32_t expected_crc = crc_j ? (uint32_t)crc_j->valuedouble : 0;
                            bool has_crc = (crc_j != NULL);
                            if (total > 0) {
                                ESP_LOGW(TAG, "UART OTA begin: %lu bytes, crc=%s%08lX",
                                         (unsigned long)total,
                                         has_crc ? "" : "none/",
                                         (unsigned long)expected_crc);
                                uart_ota_begin(total, expected_crc, has_crc, UART_NUM_1);
                            }
                        } else if (type && strcmp(type, MSG_TYPE_OTA_END) == 0) {
                            ESP_LOGI(TAG, "UART OTA finalize");
                            uart_ota_finalize();
                        } else if (type && strcmp(type, MSG_TYPE_OTA_ABORT) == 0) {
                            ESP_LOGW(TAG, "UART OTA abort");
                            uart_ota_abort();
                        }

                        cJSON_Delete(root);
                    }
                    line_pos = 0;
                }
            } else if (line_pos < (int)sizeof(line) - 1) {
                line[line_pos++] = (char)buf[i];
            } else {
                /* Buffer overflow — reset to prevent corruption */
                ESP_LOGW(TAG, "UART CMD line overflow at %d bytes, resetting (byte=0x%02X)", line_pos, buf[i]);
                line_pos = 0;
            }
        }

    }
}
#endif /* BLE_SCANNER_ONLY */

/* ── Entry point ────────────────────────────────────────────────────────── */

void app_main(void)
{
    /* ── 0. Machine-readable firmware identification ──────────────────── */
    FOF_PRINT_IDENT(TAG, FIRMWARE_NAME);

    /* Log PSRAM state at boot so it's obvious in serial whether the board
     * actually initialized external memory (N16R8 scanners → 8 MiB). */
    {
        size_t psram_total  = psram_total_size();
        size_t psram_free   = psram_free_size();
        size_t heap_int_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
        if (psram_total > 0) {
            ESP_LOGW(TAG, "PSRAM: %u KB total, %u KB free  |  Internal: %u KB free",
                     (unsigned)(psram_total / 1024),
                     (unsigned)(psram_free  / 1024),
                     (unsigned)(heap_int_free / 1024));
        } else {
            ESP_LOGW(TAG, "PSRAM: none  |  Internal: %u KB free",
                     (unsigned)(heap_int_free / 1024));
        }
    }

    /* ── 1. Initialize NVS flash ──────────────────────────────────────── */
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES ||
        ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_LOGW(TAG, "NVS partition truncated, erasing...");
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    /* ── 1b. Initialize TCP/IP network interface (required for radio subsystem) ── */
    ESP_ERROR_CHECK(esp_netif_init());

    /* ── 2. Initialize default event loop ─────────────────────────────── */
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    /* ── 3. Create shared detection queue ─────────────────────────────── */
    QueueHandle_t detection_queue = xQueueCreate(DETECTION_QUEUE_LEN,
                                                 sizeof(drone_detection_t));
    if (detection_queue == NULL) {
        ESP_LOGE(TAG, "Failed to create detection queue -- halting");
        return;
    }
    ESP_LOGI(TAG, "Detection queue created (%d slots, %u bytes each)",
             DETECTION_QUEUE_LEN, (unsigned)sizeof(drone_detection_t));

    /* ── 4. Initialize Bayesian fusion engine ─────────────────────────── */
    bayesian_fusion_init();
    ESP_LOGI(TAG, "Bayesian fusion engine initialised");

