lnxgod/friendorfoe/esp32/scanner/main/main.c
    /* ── 5. Initialize status LED ────────────────────────────────────── */
    led_init();
    led_set_pattern(LED_BOOT);

    /* ── 5b. Initialize OLED display ─────────────────────────────────── */
    oled_init();
    oled_set_version(FOF_VERSION);
    oled_update(0, 0, 0, 0, 0, 0);

    /* ── 5c. Initialize BOOT button GPIO ─────────────────────────────── */
    gpio_config_t btn_cfg = {
        .pin_bit_mask = (1ULL << BOOT_BUTTON_GPIO),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    gpio_config(&btn_cfg);
    ESP_LOGI(TAG, "BOOT button on GPIO%d (tap=scroll, 2x=privacy)", BOOT_BUTTON_GPIO);

    /* ── 6. Initialize UART TX (hardware setup, no task yet) ──────────── */
    uart_tx_init();

#ifndef BLE_SCANNER_ONLY
    /* ── 7. Initialize WiFi scanner (sets up promiscuous mode) ────────── */
    wifi_scanner_init(detection_queue);
    ESP_LOGI(TAG, "WiFi scanner initialised");
#else
    ESP_LOGI(TAG, "WiFi scanner DISABLED (BLE-only mode)");
#endif

#ifndef WIFI_SCANNER_ONLY
    /* ── 7b. Initialize BLE scanner (NimBLE) ─────────────────────────── */
    ble_remote_id_init(detection_queue);
    ESP_LOGI(TAG, "BLE Remote ID scanner initialised");

#if CONFIG_FOF_GLASSES_DETECTION
    /* ── 7c. Create glasses detection queue and wire to BLE scanner ───── */
    s_glasses_queue = xQueueCreate(10, sizeof(glasses_detection_t));
    if (s_glasses_queue != NULL) {
        ble_remote_id_set_glasses_queue(s_glasses_queue);
        memset(s_glasses_cache, 0, sizeof(s_glasses_cache));
        ESP_LOGI(TAG, "Glasses detection queue created (10 slots)");
    }
#endif
#else
    ESP_LOGI(TAG, "BLE scanner DISABLED (WiFi-only mode)");
#endif

    /* Start UART TX task on Core 1 (processing core).
     * The TX task has a 10s startup delay to let the uplink boot first. */
    uart_tx_start(detection_queue);

    /* ── 8. Set scanner identity — sent by TX task after startup delay ── */
    {
#if defined(BLE_SCANNER_ONLY)
        const char *bname = "scanner-s3-ble", *cname = "esp32s3", *caps = "ble";
#elif defined(WIFI_SCANNER_ONLY) && defined(CONFIG_IDF_TARGET_ESP32C5)
        const char *bname = "scanner-c5", *cname = "esp32c5", *caps = "wifi,5ghz";
#elif defined(WIFI_SCANNER_ONLY)
        const char *bname = "scanner-esp32", *cname = "esp32", *caps = "wifi";
#elif defined(SEED_SCANNER_PINS)
        const char *bname = "scanner-s3-combo-seed", *cname = "esp32s3", *caps = "ble,wifi";
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
        const char *bname = "scanner-s3-combo", *cname = "esp32s3", *caps = "ble,wifi";
#else
        const char *bname = "scanner-esp32", *cname = "esp32", *caps = "wifi";
#endif
        /* Store identity — TX task will send it after its startup delay */
        uart_tx_set_identity(bname, cname, caps);
    }

#ifndef BLE_SCANNER_ONLY
    /* ── 9. Start WiFi scanner task on Core 0 (radio core) ───────────── */
    wifi_scanner_start();
    ESP_LOGI(TAG, "WiFi scanner started on core %d, priority %d",
             WIFI_SCAN_TASK_CORE, WIFI_SCAN_TASK_PRIORITY);
#endif

#ifndef WIFI_SCANNER_ONLY
    /* ── 9b. Start BLE scanner ───────────────────────────────────────── */
    ble_remote_id_start();
    ESP_LOGI(TAG, "BLE scanner started");
#endif

    /* ── 10. Start LED task ───────────────────────────────────────────── */
    led_start();
    led_set_pattern(LED_UPLINK_OK);   /* purple — UART active, connected to uplink */

    /* ── 11. Start display task ──────────────────────────────────────── */
    xTaskCreatePinnedToCore(
        display_task,
        "display",
        DISPLAY_TASK_STACK_SIZE,
        NULL,
        DISPLAY_TASK_PRIORITY,
        NULL,
        DISPLAY_TASK_CORE
    );
    ESP_LOGI(TAG, "Display task started on core %d, priority %d",
             DISPLAY_TASK_CORE, DISPLAY_TASK_PRIORITY);

    /* ── 12. Startup banner ───────────────────────────────────────────── */
    ESP_LOGI(TAG, "============================================");
    ESP_LOGI(TAG, "  Friend or Foe — %s v%s", FIRMWARE_NAME, FOF_VERSION);
#if CONFIG_IDF_TARGET_ESP32C5
    ESP_LOGI(TAG, "  ESP32-C5 single-core RISC-V @ 240 MHz");
    ESP_LOGI(TAG, "  WiFi 6 dual-band + BLE 5");
#elif CONFIG_IDF_TARGET_ESP32S3
    ESP_LOGI(TAG, "  ESP32-S3 dual-core @ 240 MHz");
    ESP_LOGI(TAG, "  WiFi + BLE 5");
#elif CONFIG_IDF_TARGET_ESP32
    ESP_LOGI(TAG, "  ESP32 dual-core Xtensa @ 240 MHz");
    ESP_LOGI(TAG, "  WiFi promiscuous scanner");
#endif
    ESP_LOGI(TAG, "  UART1 -> Uplink @ %d baud", UART_BAUD_RATE);
    ESP_LOGI(TAG, "  Detection queue: %d slots", DETECTION_QUEUE_LEN);
    ESP_LOGI(TAG, "  BOOT button: tap=scroll, 2x=privacy view");
    ESP_LOGI(TAG, "============================================");

    /* ── 13. UART command listener (receives lock-on from uplink) ────── */
#ifndef BLE_SCANNER_ONLY
    xTaskCreatePinnedToCore(
        uart_cmd_listener_task,
        "uart_cmd",
        8192,   /* Increased from 4096: esp_ota_write needs ~2-3KB stack */
        NULL,
        3,      /* Raised from 1: must compete with WiFi/BLE scan tasks during OTA */
        NULL,
        DISPLAY_TASK_CORE
    );
    ESP_LOGI(TAG, "UART command listener started");
#endif

    /* app_main returns; FreeRTOS scheduler keeps tasks running. */
}
